app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
 def index
 @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 2 AND ("comments".post_id = 1))
---
  def show
 @post = Post.find(params[:post_id])
  @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def new
 @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "commenter", "created_at") VALUES('2009-11-05 00:06:48', '!!!!!!!!!!!!!!!!!!!!', 1, 'argle bargle', '2009-11-05 00:06:48')
---
  def create
 @post = Post.find(params[:post_id])
  @comment = @post.comments.build(params[:comment])
  if @comment.save