app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts" LIMIT 1

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "updated_at", "title", "content", "created_at") VALUES('Rob', '2009-11-04 23:11:09', 'First Post', 'Hi there!', '2009-11-04 23:11:09')

  def update

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "content" = 'Hi there! !!!!', "updated_at" = '2009-11-04 23:11:20' WHERE "id" = 1

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "id" = 2

    def find_post
      @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)